/*
1. advance(n) 함수를 구현하시오. advance(n) 함수를 호출하면 현재 노드가 n 노드 만큼 전진한다.
2. back(n) 함수를 구현하시오. back(n) 함수를 호출하면 현재 노드가 n 노드 만큼 후진한다.
3. 현재 노드의 데이터를 출력하는 show() 함수를 구현하시오.
4. 대화형으로 입력된 테스트 점수를 단방향 연결 리스트로 저장하는 프로그램을 구현하시오.
5. 양방향 연결 리스트를 이용해 [예제 6-4]를 다시 구현하시오.
6. 전설에 의하면 1세기에 유대인 로마 전쟁 당시 역사가 플라비우스 요세푸스와 40명의 유대인이 로마 군인에게 붙잡힐 위기에 처했다. 유대인 병사들은 포로로 잡히느니 죽음을 택하기로 했다. 사람으로 원을 만든 다음 사람이 남지 않을 때까지 매 세 번째 병사를 죽여 나가기로 작전을 세웠다. 요세푸스와 다른 한 명은 일찍 죽임을 당하는 위치에 서고 싶지 않아 어디에 서야 최후까지 생존할 수 있을지 빨리 계산해야 했다. n명의 사람이 원을 만들고 매 m번째 사람을 죽이는 프로그램을 구현하시오. 그리고 마지막으로 남을 두 사람을 계산하시오. 순환형 연결 리스트를 이용해 이 문제를 해결한다.
*/